jeffreyqjf/STM32_PN532/Module/NFC_I2C/I2C.c
#include "stm32f10x.h"                  // Device header
#include "GPIO_init.h"
#include "Delay.h"

void MyI2C_W_SCL(uint8_t BitValue){
	GPIO_WriteBit(GPIOB, GPIO_Pin_10, (BitAction)BitValue);
	Delay_us(10);
}


void MyI2C_W_SDA(uint8_t BitValue){
	GPIO_WriteBit(GPIOB, GPIO_Pin_11, (BitAction)BitValue);
	Delay_us(10);
}


uint8_t MyI2C_R_SCL(void){
	uint8_t BitValue;
	BitValue = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_10);
	Delay_us(10);
	return BitValue;
}


uint8_t MyI2C_R_SDA(void){
	uint8_t BitValue;
	BitValue = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11);
	Delay_us(10);
	return BitValue;
}


void MyI2C_init(void){
	GPIOB_init(GPIO_Mode_Out_OD, GPIO_Pin_10);
	GPIOB_init(GPIO_Mode_Out_OD, GPIO_Pin_11);
	GPIO_SetBits(GPIOB, GPIO_Pin_10 | GPIO_Pin_11);
}


void MyI2C_Start(void){
	MyI2C_W_SDA(1);
	MyI2C_W_SCL(1);
	MyI2C_W_SDA(0);
	MyI2C_W_SCL(0);
}


void MyI2C_Stop(void){
	MyI2C_W_SDA(0);
	MyI2C_W_SCL(1);
	MyI2C_W_SDA(1);
}

void MyI2C_SendByte(uint8_t Byte){
	for(int i = 0; i < 8; i++){
		MyI2C_W_SDA(Byte & (0x80 >> i));
		MyI2C_W_SCL(1);
		MyI2C_W_SCL(0);
	}
}

uint8_t MyI2C_ReceiveByte(void){
	uint8_t Byte = 0x00;
	MyI2C_W_SDA(1);
	for(int i = 0; i < 8;i++){
		MyI2C_W_SCL(1);	
		if(MyI2C_R_SDA() == 1){Byte |= (0x80 >> i);}
		MyI2C_W_SCL(0);
	}
	return Byte; 
}


void MyI2C_SendAck(uint8_t AckBit){
		MyI2C_W_SDA(AckBit);
		MyI2C_W_SCL(1);
		MyI2C_W_SCL(0);
}

uint8_t MyI2C_ReceiveAck(void){
	uint8_t AckBit;
	MyI2C_W_SDA(1);
	MyI2C_W_SCL(1);	
	AckBit = MyI2C_R_SDA();
	MyI2C_W_SCL(0);
	return AckBit; 
}
 
